Vorlesung/ParProg-ParalleleAlgorithmen.org
#+SETUPFILE: ./theme-bigblow-local.setup
#+TITLE: Parallele Algorithmen
#+SUBTITLE: Parallelprogrammierung
# Titel fraglich
#+AUTHOR: Johannes Brauer
#+OPTIONS:   H:4
#+OPTIONS: num:nil d:true
#+OPTIONS: toc:nil
#+OPTIONS: reveal_single_file:nil
#+Language:  de
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
# +REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_THEME: simple
#+REVEAL_TRANS: slide
#+REVEAL_HLEVEL: 1
#+REVEAL_INIT_SCRIPT: dependencies: [ { src: 'plugin/menu/menu.js', async: true },
#+REVEAL_INIT_SCRIPT:                 { src: 'reveal.js/plugin/zoom-js/zoom.js', async: true } ]
#+REVEAL_MARGIN: 0.05
#+REVEAL_EXTRA_CSS: ./mycss/myrevealstyle.css
#+OPTIONS: reveal_control:t
# um Folien mit reveal.js erzeugen zu können:ml
# M-x load-library und dann ox-reveal

* Grundlagen 
# Chapter 10
** Overview of Parallelism Beyond Concurrency
# Chapter 10 parallelismOverview.txt
 Parallelism in computing

+ So far the emphasis has been on parallelism as concurrency made
  efficient: multiple concurrent tasks are distributed among
  processors so that the tasks can be processed literally at the same
  time--in parallel.
+ In a multiprocessing approach to concurrency, multiple processes
  execute on multiple processors.
  + The OS handles the scheduling.
+ In a multithreading approach to concurrency, multiple threads within a process execute on multiple processors.
  + If API threads map to /native/ threads, then the OS handles the scheduling. (Assuming no GIL.)
+ In hybrid approaches (e.g., Asp.Net's multithreaded worker
  processes), there's still the distribution of task processing among
  multiple processors.

The goal now is to focus on broader uses of parallel computation.

+ Some reasons why parallelism is now so attractive:
  + Consumer desktop, laptop, and even handheld machines are now
    multi-core, with one or more processors per core.
    + In fact (even if not in reputation), these machines are /parallel computers/.
    + At issue is how to exploit this possibily for parallel computations.
  + Consumer-level machines may come with GPUs (graphics-processing
    units) and FPUs (floating-point unit or /math coproccessor/) as
    well as CPUs (central or /generic/ processing units).
    + GPUs and FPUs are designed for parallelism.
    + /gpgpu/ (general-purpose computing on a GPU) refers to the use
      of a GPU for /general purposes/, that is, purposes beyond just
      graphics. So gpgpu approaches a GPU as if it were a
      (specialized) CPU.
  + Distributed software systems such as email and the WWW have code
    modules that execute on physically distinct devices.
    + The /network as the computer/ describes networked hosts, each
      with its own collection of processors, as a resource for
      distributed parallel computation.
    + The key challenge is how to coordinate such computations and to share information among them.
      + Message-passing is a popular, general method.
+ Parallel computations may used shared, centralized memory;
  distributed memory; or some hybrid of the two.
  + The point of interest is how to write programs that execute as
    parallel computations.
  + Support from toolchains (in particular, compilers therein) is
    critical to encouarge widespread use of hardware support for
    parallel computing.

** A SIMD Auto Vectorization Code Example in C
*** the non parallel version
#+BEGIN_SRC C
/** To compile and run:

    gcc -o nonsimd nonsimd.c
    ./nonsimd  # On Windows: simd
,*/
  
#include <stdio.h>

#define Length 8

int main() {
  int array1[ ] = {1, 2, 3, 4, 5, 6, 7, 8}; 
  int array2[ ] = {8, 7, 6, 5, 4, 3, 2, 1}; 
  int sum[Length];

  int i;
  for (i = 0; i < Length; i++) sum[i] = array1[i] + array2[i]; /** serial computation **/
  
  for (i = 0; i < Length; i++) printf("%i ", sum[i]);  /** ideal case for data parallelism **/
  putchar('\n');
  return 0;
}
/** A better way: SSE = Streaming SIMD Extensions = additional instruction set, 
    more CPU registers

In the late 1990s, Intel introduced an SSE instruction set for their Pentium III
processors. This became known as the MMX instruction set. (Officially, MMX is not an
acronym.) AMD earlier introduced a comparable instruction set known as 3DNow!. In any case, 
the hardware support included new registers with names that start with 'xmm'. In the 
original SSE, there was support only for integer operations.

SEE has progressed, with new versions: SSE2, SSE3, SSSE3, and
SSE4. The newer versions bring SIMD support for both integer and
floating-point operations. At the same time, C/C++ compilers such as
GNU and Clang provided support, eventually automatic, for
SIMD-friendly code. Nowadays, both compilers are capable of 'automatic
vectorization' of approrpiately written source code.

The short version: elements in the arrays 'array1' and 'array2' should
be added pairwise in parallel in order to boost performance.
,*/
#+END_SRC
