Vorlesung/ParProg-ParalleleAlgorithmen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2017-11-09 Thu 15:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Parallele Algorithmen</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johannes Brauer" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
</head>
<body>
<div id="content">
<h1 class="title">Parallele Algorithmen
<br />
<span class="subtitle">Parallelprogrammierung</span>
</h1>

<div id="outline-container-org1609c36" class="outline-2">
<h2 id="org1609c36">Grundlagen</h2>
<div class="outline-text-2" id="text-org1609c36">
</div>
<div id="outline-container-org0ae1915" class="outline-3">
<h3 id="org0ae1915">Overview of Parallelism Beyond Concurrency</h3>
<div class="outline-text-3" id="text-org0ae1915">
<p>
Parallelism in computing
</p>

<ul class="org-ul">
<li>So far the emphasis has been on parallelism as concurrency made
efficient: multiple concurrent tasks are distributed among
processors so that the tasks can be processed literally at the same
time&#x2013;in parallel.</li>
<li>In a multiprocessing approach to concurrency, multiple processes
execute on multiple processors.
<ul class="org-ul">
<li>The OS handles the scheduling.</li>
</ul></li>
<li>In a multithreading approach to concurrency, multiple threads within a process execute on multiple processors.
<ul class="org-ul">
<li>If API threads map to <i>native</i> threads, then the OS handles the scheduling. (Assuming no GIL.)</li>
</ul></li>
<li>In hybrid approaches (e.g., Asp.Net's multithreaded worker
processes), there's still the distribution of task processing among
multiple processors.</li>
</ul>

<p>
The goal now is to focus on broader uses of parallel computation.
</p>

<ul class="org-ul">
<li>Some reasons why parallelism is now so attractive:
<ul class="org-ul">
<li>Consumer desktop, laptop, and even handheld machines are now
multi-core, with one or more processors per core.
<ul class="org-ul">
<li>In fact (even if not in reputation), these machines are <i>parallel computers</i>.</li>
<li>At issue is how to exploit this possibily for parallel computations.</li>
</ul></li>
<li>Consumer-level machines may come with GPUs (graphics-processing
units) and FPUs (floating-point unit or <i>math coproccessor</i>) as
well as CPUs (central or <i>generic</i> processing units).
<ul class="org-ul">
<li>GPUs and FPUs are designed for parallelism.</li>
<li><i>gpgpu</i> (general-purpose computing on a GPU) refers to the use
of a GPU for <i>general purposes</i>, that is, purposes beyond just
graphics. So gpgpu approaches a GPU as if it were a
(specialized) CPU.</li>
</ul></li>
<li>Distributed software systems such as email and the WWW have code
modules that execute on physically distinct devices.
<ul class="org-ul">
<li>The <i>network as the computer</i> describes networked hosts, each
with its own collection of processors, as a resource for
distributed parallel computation.</li>
<li>The key challenge is how to coordinate such computations and to share information among them.
<ul class="org-ul">
<li>Message-passing is a popular, general method.</li>
</ul></li>
</ul></li>
</ul></li>
<li>Parallel computations may used shared, centralized memory;
distributed memory; or some hybrid of the two.
<ul class="org-ul">
<li>The point of interest is how to write programs that execute as
parallel computations.</li>
<li>Support from toolchains (in particular, compilers therein) is
critical to encouarge widespread use of hardware support for
parallel computing.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb5b6dbd" class="outline-3">
<h3 id="orgb5b6dbd">A SIMD Auto Vectorization Code Example in C</h3>
<div class="outline-text-3" id="text-orgb5b6dbd">
</div><div id="outline-container-org3f63d94" class="outline-4">
<h4 id="org3f63d94">the non parallel version</h4>
<div class="outline-text-4" id="text-org3f63d94">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">To compile and run:</span>

<span style="color: #8D8D84; font-style: italic;">    gcc -o nonsimd nonsimd.c</span>
<span style="color: #8D8D84; font-style: italic;">    ./nonsimd  # On Windows: simd</span>
<span style="color: #8D8D84;">*/</span>
  
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdio.h</span><span style="color: #707183;">&gt;</span>

<span style="color: #808080;">#define</span> <span style="color: #BA36A5;">Length</span> 8

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">array1</span><span style="color: #7388D6;">[</span> <span style="color: #7388D6;">]</span> = <span style="color: #7388D6;">{</span>1, 2, 3, 4, 5, 6, 7, 8<span style="color: #7388D6;">}</span>; 
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">array2</span><span style="color: #7388D6;">[</span> <span style="color: #7388D6;">]</span> = <span style="color: #7388D6;">{</span>8, 7, 6, 5, 4, 3, 2, 1<span style="color: #7388D6;">}</span>; 
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">sum</span><span style="color: #7388D6;">[</span>Length<span style="color: #7388D6;">]</span>;

  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span>;
  <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; Length; i++<span style="color: #7388D6;">)</span> sum<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span> = array1<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span> + array2<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span>; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">serial computation *</span><span style="color: #8D8D84;">*/</span>
  
  <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; Length; i++<span style="color: #7388D6;">)</span> printf<span style="color: #7388D6;">(</span><span style="color: #008000;">"%i "</span>, sum<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span>;  <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">ideal case for data parallelism *</span><span style="color: #8D8D84;">*/</span>
  putchar<span style="color: #7388D6;">(</span><span style="color: #008000;">'\n'</span><span style="color: #7388D6;">)</span>;
  <span style="color: #0000FF;">return</span> 0;
<span style="color: #707183;">}</span>
<span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">A better way: SSE = Streaming SIMD Extensions = additional instruction set, </span>
<span style="color: #8D8D84; font-style: italic;">    more CPU registers</span>

<span style="color: #8D8D84; font-style: italic;">In the late 1990s, Intel introduced an SSE instruction set for their Pentium III</span>
<span style="color: #8D8D84; font-style: italic;">processors. This became known as the MMX instruction set. (Officially, MMX is not an</span>
<span style="color: #8D8D84; font-style: italic;">acronym.) AMD earlier introduced a comparable instruction set known as 3DNow!. In any case, </span>
<span style="color: #8D8D84; font-style: italic;">the hardware support included new registers with names that start with 'xmm'. In the </span>
<span style="color: #8D8D84; font-style: italic;">original SSE, there was support only for integer operations.</span>

<span style="color: #8D8D84; font-style: italic;">SEE has progressed, with new versions: SSE2, SSE3, SSSE3, and</span>
<span style="color: #8D8D84; font-style: italic;">SSE4. The newer versions bring SIMD support for both integer and</span>
<span style="color: #8D8D84; font-style: italic;">floating-point operations. At the same time, C/C++ compilers such as</span>
<span style="color: #8D8D84; font-style: italic;">GNU and Clang provided support, eventually automatic, for</span>
<span style="color: #8D8D84; font-style: italic;">SIMD-friendly code. Nowadays, both compilers are capable of 'automatic</span>
<span style="color: #8D8D84; font-style: italic;">vectorization' of approrpiately written source code.</span>

<span style="color: #8D8D84; font-style: italic;">The short version: elements in the arrays 'array1' and 'array2' should</span>
<span style="color: #8D8D84; font-style: italic;">be added pairwise in parallel in order to boost performance.</span>
<span style="color: #8D8D84;">*/</span></pre>
</pre>
</div>
</div>
</div>
