Vorlesung/ParProg-ParalleleAlgorithmen.html
<div id="outline-container-orge081793" class="outline-4">
<h4 id="orge081793">the parallel version</h4>
<div class="outline-text-4" id="text-orge081793">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">To compile and run:</span>

<span style="color: #8D8D84; font-style: italic;">    gcc -o simd simd.c</span>
<span style="color: #8D8D84; font-style: italic;">    ./simd  # On Windows: simd</span>

<span style="color: #8D8D84; font-style: italic;"> No explicit optimization is required. The GNU and Clang compilers</span>
<span style="color: #8D8D84; font-style: italic;"> do the optimization automatically. </span>
<span style="color: #8D8D84;">*/</span>
  
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdio.h</span><span style="color: #707183;">&gt;</span>

<span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">A typedef in C supports 'aliasing' of data types. Here's a simple example:</span>

<span style="color: #8D8D84; font-style: italic;">     typedef unsigned boolean; ## 'unsigned' is short for 'unsigned int'</span>

<span style="color: #8D8D84; font-style: italic;">   This typedef allows 'boolean' to be used in place of 'unsigned', for example:</span>

<span style="color: #8D8D84; font-style: italic;">     boolean flag = 0;  ## 0 is 'false' in C</span>

<span style="color: #8D8D84; font-style: italic;">   The typedef below is more complicated, as it includes special information for the</span>
<span style="color: #8D8D84; font-style: italic;">   compiler, in particuar the '__attribute__' and 'vector_size' terms. Here's the upshot</span>
<span style="color: #8D8D84; font-style: italic;">   of the typedef:</span>

<span style="color: #8D8D84; font-style: italic;">   # 'intV8' aliases 'int', but as a vector (1-dimensional array) rather than as a scalar </span>
<span style="color: #8D8D84; font-style: italic;">      type.</span>
<span style="color: #8D8D84; font-style: italic;">   # The size of an 'intV8' vector is set to 32 == Length * sizeof(int) == 8 * 4. </span>
<span style="color: #8D8D84; font-style: italic;">     The size is in bytes.</span>
<span style="color: #8D8D84;">*/</span>
<span style="color: #808080;">#define</span> <span style="color: #BA36A5;">Length</span> 8
<span style="color: #0000FF;">typedef</span> <span style="color: #6434A3;">int</span> <span style="color: #6434A3;">intV8</span> <span style="color: #0000FF;">__attribute__</span> <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span>vector_size <span style="color: #909183;">(</span><span style="color: #6434A3;">Length</span> * <span style="color: #0000FF;">sizeof</span><span style="color: #709870;">(</span><span style="color: #6434A3;">int</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">32 bytes *</span><span style="color: #8D8D84;">*/</span>
    
<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  <span style="color: #6434A3;">intV8</span> <span style="color: #BA36A5;">dataV1</span> = <span style="color: #7388D6;">{</span>1, 2, 3, 4, 5, 6, 7, 8<span style="color: #7388D6;">}</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">initialize vector dataV1: no array syntax </span><span style="color: #8D8D84;">*/</span>                   
  <span style="color: #6434A3;">intV8</span> <span style="color: #BA36A5;">dataV2</span> = <span style="color: #7388D6;">{</span>8, 7, 6, 5, 4, 3, 2, 1<span style="color: #7388D6;">}</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">same for vector dataV2 </span><span style="color: #8D8D84;">*/</span>
  
  <span style="color: #6434A3;">intV8</span> <span style="color: #BA36A5;">add</span> = dataV1 + dataV2; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">9  9  9  9  9  9  9 9 -- no array syntax </span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">intV8</span> <span style="color: #BA36A5;">mul</span> = dataV1 * dataV2; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">8 14 18 20 20 18 14 8 -- no array syntax </span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">intV8</span> <span style="color: #BA36A5;">div</span> = dataV2 / dataV1; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">8  3  2  1  0  0  0 0 -- no array syntax </span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span>;
  <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; Length; i++<span style="color: #7388D6;">)</span> printf<span style="color: #7388D6;">(</span><span style="color: #008000;">"%i "</span>, add<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">array syntax </span><span style="color: #8D8D84;">*/</span>
  putchar<span style="color: #7388D6;">(</span><span style="color: #008000;">'\n'</span><span style="color: #7388D6;">)</span>;
  <span style="color: #0000FF;">return</span> 0;
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5e288a3" class="outline-3">
<h3 id="org5e288a3">using the shell</h3>
<div class="outline-text-3" id="text-org5e288a3">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ gcc -o nonsimd nonsimd.c
bash-3.2$ gcc -o simd simd.c

bash-3.2$ ./nonsimd
9 9 9 9 9 9 9 9 

bash-3.2$ ./simd
9 9 9 9 9 9 9 9 </pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org89b8674" class="outline-3">
<h3 id="org89b8674">in Assembly-Code</h3>
<div class="outline-text-3" id="text-org89b8674">
<p>
Some compiler-generated assembly code from the simd.c program
</p>
<pre class="example">
# A note on C compilation:

                 +------------+    +--------+    +---------+    +------+
C source code---&gt;|preprocessor|---&gt;|compiler|---&gt;|assembler|---&gt;|linker|---&gt;executable 	
                 +------------+    +--------+ /  +---------+ /  +------+    machine code
                                             /              /
                                        assembly code    object code

## Compile command: gcc -S simd.c  (produces 'simd.s' by default)	
	
main:
   ## The identifiers that start with $ are constants.
	
   ## %rsp is the /stack pointer/, which points to the TOP position on the stack.
	
   ## An expression such as 96(%rsp) is an address or pointer expression: %rsp is the base 
      address, 96 is of the offset therefrom. The offset is in bytes, so in this case it/s 
      96 bytes. (The Intel stack grows downwards, from high to low addresses.)

   ## The full expression 'movl $1, 96(%rsp)' copies (not literally moves) the 32-bit value 
      1 into stack location %rsp + 96:

	The stack
	  ...                     ## high addresses
	+-----+
	|  1  |&lt;------%rsp + 96   ## instruction 'movl $l, 96(%rsp)' puts 1 in this location
        +-----+
	  ...                
	+-----+
	|     |
	+-----+
	|     |&lt;------%rsp   ## %rsp is the 64-bit 'stack pointer'
	+-----+
	  ...                     ## low addresses
	
   ## Note that every offset increases by 4 because the values (1,2,3,...) are 4-byte 
      (32-bit) integer values.
   movl $1, 96(%rsp)         # data vector 1 start
   movl $2, 100(%rsp)
   movl $3, 104(%rsp)
   movl $4, 108(%rsp)
   movl $5, 112(%rsp)
   movl $6, 116(%rsp)
   movl $7, 120(%rsp)
   movl $8, 124(%rsp)        # data vector 1 end
   movl $8, 128(%rsp)        # data vector 2 start
   movl $7, 132(%rsp)
   movl $6, 136(%rsp)
   movl $5, 140(%rsp)
   movl $4, 144(%rsp)
   movl $3, 148(%rsp)
   movl $2, 152(%rsp)
   movl $1, 156(%rsp)        # data vector 2 end
	
   movdqa 96(%rsp), %xmm1    # %xmm1 = dataV1[0..3]: 'dq' is for 'double quadword'
	                     # (quad == 64 bits) and %xmm1 is a 128-bit register
	
   movdqa 128(%rsp), %xmm0   # %xmm0 = dataV2[0..3]
	
   paddd %xmm0, %xmm1        # %xmm1 += %xmm0 (the 'paddd' instruction is for 'packed 
                               addition' of 32-bit values)
   movdqa 112(%rsp), %xmm2   # %xmm2 = dataV1[4..7]
   movdqa 144(%rsp), %xmm0   # %xmm0 = dataV2[4..7]
   paddd %xmm2, %xmm0        # %xmm0 += %xmm2
	
   movdqa %xmm1, 32(%rsp)    # save %xmm1 to stack (sums of the 1st four elements)
   movdqa %xmm0, 48(%rsp)    # save %xmm0 to stack (sums of the last four elements)
	                     # the sum is now on the stack contiguously, in effect as an array
   ...

</pre>
</div>
</div>
</div>
<div id="outline-container-orgbe16785" class="outline-2">
<h2 id="orgbe16785">Zeitmessungen &#x2013; ein Code-Beispiel</h2>
<div class="outline-text-2" id="text-orgbe16785">
</div>
