Vorlesung/ParProg-ParalleleAlgorithmen.html
<div id="outline-container-orge9dd873" class="outline-3">
<h3 id="orge9dd873">Source Code</h3>
<div class="outline-text-3" id="text-orge9dd873">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">A timing example to contrast serial and parallel execution on typical matrix/vector </span>
<span style="color: #8D8D84; font-style: italic;">    operations. The program uses 'SSE intrinsics', the interface for which is the header </span>
<span style="color: #8D8D84; font-style: italic;">    file 'xmmintrin.h'.</span>
<span style="color: #8D8D84; font-style: italic;">    </span>
<span style="color: #8D8D84; font-style: italic;">    Some of the code is obscure, a good sign of what's involved as you get ever closer </span>
<span style="color: #8D8D84; font-style: italic;">    to the metal.</span>

<span style="color: #8D8D84; font-style: italic;">    The program adds two vectors, and then multiples the rows of the sum vector by a </span>
<span style="color: #8D8D84; font-style: italic;">    +third vector.</span>
<span style="color: #8D8D84; font-style: italic;">*</span><span style="color: #8D8D84;">*/</span>

<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdio.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">xmmintrin.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdint.h</span><span style="color: #707183;">&gt;</span>

<span style="color: #0000FF;">typedef</span> <span style="color: #6434A3;">void</span> <span style="color: #707183;">(</span>*<span style="color: #6434A3;">func</span><span style="color: #707183;">)()</span>;  <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">a function that takes no arguments and returns void *</span><span style="color: #8D8D84;">*/</span>

<span style="color: #808080;">#define</span> <span style="color: #BA36A5;">Length</span>      <span style="color: #707183;">(</span>2048<span style="color: #707183;">)</span>
<span style="color: #808080;">#define</span> <span style="color: #BA36A5;">AlignedVals</span>    <span style="color: #707183;">(</span>4<span style="color: #707183;">)</span>

 <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">Ensure 16-byte alignment of vector elements: 16 bytes is 4 ints or 4 floats,</span>
<span style="color: #8D8D84; font-style: italic;">     which comes to 128 bits--the size of an %xmm register. *</span><span style="color: #8D8D84;">*/</span>
<span style="color: #6434A3;">float</span> <span style="color: #BA36A5;">v1</span><span style="color: #707183;">[</span>Length<span style="color: #707183;">]</span> <span style="color: #0000FF;">__attribute__</span> <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span>aligned<span style="color: #909183;">(</span>16<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>; 
<span style="color: #6434A3;">float</span> <span style="color: #BA36A5;">v2</span><span style="color: #707183;">[</span>Length<span style="color: #707183;">]</span> <span style="color: #0000FF;">__attribute__</span> <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span>aligned<span style="color: #909183;">(</span>16<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
<span style="color: #6434A3;">float</span> <span style="color: #BA36A5;">v3</span><span style="color: #707183;">[</span>Length<span style="color: #707183;">]</span> <span style="color: #0000FF;">__attribute__</span> <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span>aligned<span style="color: #909183;">(</span>16<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
<span style="color: #6434A3;">float</span> <span style="color: #BA36A5;">r1</span><span style="color: #707183;">[</span>Length<span style="color: #707183;">]</span> <span style="color: #0000FF;">__attribute__</span> <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span>aligned<span style="color: #909183;">(</span>16<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
<span style="color: #6434A3;">float</span> <span style="color: #BA36A5;">r2</span><span style="color: #707183;">[</span>Length<span style="color: #707183;">]</span> <span style="color: #0000FF;">__attribute__</span> <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span>aligned<span style="color: #909183;">(</span>16<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">Initialize with small random values. *</span><span style="color: #8D8D84;">*/</span>
<span style="color: #6434A3;">void</span> <span style="color: #006699;">init</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  <span style="color: #6434A3;">unsigned</span> <span style="color: #BA36A5;">i</span>;
  <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; Length; i++<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
    v1<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span> = <span style="color: #909183;">(</span><span style="color: #6434A3;">float</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>rand<span style="color: #709870;">()</span> / RAND_MAX<span style="color: #909183;">)</span>; 
    v2<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span> = <span style="color: #909183;">(</span><span style="color: #6434A3;">float</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>rand<span style="color: #709870;">()</span> / RAND_MAX<span style="color: #909183;">)</span>;  
    v3<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span> = <span style="color: #909183;">(</span><span style="color: #6434A3;">float</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>rand<span style="color: #709870;">()</span> / RAND_MAX<span style="color: #909183;">)</span>; 
  <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #6434A3;">void</span> <span style="color: #006699;">in_serial</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  <span style="color: #6434A3;">unsigned</span> <span style="color: #BA36A5;">i</span>;
  <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; Length; i++<span style="color: #7388D6;">)</span> r1<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span> = <span style="color: #7388D6;">(</span>v1<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span> + v2<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span> * v3<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span>; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">the math *</span><span style="color: #8D8D84;">*/</span>
<span style="color: #707183;">}</span>

<span style="color: #6434A3;">void</span> <span style="color: #006699;">in_parallel</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">set up for the special vector instructions *</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">__m128</span>* <span style="color: #BA36A5;">mm_v1</span> = <span style="color: #7388D6;">(</span><span style="color: #6434A3;">__m128</span>*<span style="color: #7388D6;">)</span> v1; 
  <span style="color: #6434A3;">__m128</span>* <span style="color: #BA36A5;">mm_v2</span> = <span style="color: #7388D6;">(</span><span style="color: #6434A3;">__m128</span>*<span style="color: #7388D6;">)</span> v2;
  <span style="color: #6434A3;">__m128</span>* <span style="color: #BA36A5;">mm_v3</span> = <span style="color: #7388D6;">(</span><span style="color: #6434A3;">__m128</span>*<span style="color: #7388D6;">)</span> v3;
  <span style="color: #6434A3;">__m128</span>* <span style="color: #BA36A5;">mm_rv</span> = <span style="color: #7388D6;">(</span><span style="color: #6434A3;">__m128</span>*<span style="color: #7388D6;">)</span> r2;

  <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">Multiply a vector row by a vector: the outer instruction is _mm_mul_ps. </span>
<span style="color: #8D8D84; font-style: italic;">      _mm_add_ps adds vector elements.</span>
<span style="color: #8D8D84; font-style: italic;">   *</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">unsigned</span> <span style="color: #BA36A5;">i</span>;
  <span style="color: #6434A3;">unsigned</span> <span style="color: #BA36A5;">n</span> = Length / AlignedVals; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">in this case, n == 512 *</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #0000FF;">for</span><span style="color: #7388D6;">(</span> i = 0; i &lt; n; i++<span style="color: #7388D6;">)</span> mm_rv<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span> = _mm_mul_ps<span style="color: #7388D6;">(</span>_mm_add_ps<span style="color: #909183;">(</span>mm_v1<span style="color: #709870;">[</span>i<span style="color: #709870;">]</span>, mm_v2<span style="color: #709870;">[</span>i<span style="color: #709870;">]</span><span style="color: #909183;">)</span>, mm_v3<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span>;
<span style="color: #707183;">}</span>

<span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">from the Intel developer's guide: in-line assembly for reasonably good timings *</span><span style="color: #8D8D84;">*/</span>
<span style="color: #6434A3;">uint64_t</span> <span style="color: #006699;">rdtsc</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
    <span style="color: #6434A3;">uint32_t</span> <span style="color: #BA36A5;">lo</span>, <span style="color: #BA36A5;">hi</span>;
    <span style="color: #0000FF;">__asm__</span> __volatile__ <span style="color: #7388D6;">(</span>
      <span style="color: #008000;">"xorl %%eax, %%eax\n"</span>
      <span style="color: #008000;">"cpuid\n"</span>
      <span style="color: #008000;">"rdtsc\n"</span>
      : <span style="color: #008000;">"=a"</span> <span style="color: #909183;">(</span>lo<span style="color: #909183;">)</span>, <span style="color: #008000;">"=d"</span> <span style="color: #909183;">(</span>hi<span style="color: #909183;">)</span>
      :
      : <span style="color: #008000;">"%ebx"</span>, <span style="color: #008000;">"%ecx"</span><span style="color: #7388D6;">)</span>;
    <span style="color: #0000FF;">return</span> <span style="color: #7388D6;">(</span><span style="color: #6434A3;">uint64_t</span><span style="color: #7388D6;">)</span> hi &lt;&lt; 32 | lo;
<span style="color: #707183;">}</span>

<span style="color: #6434A3;">void</span> <span style="color: #006699;">time_it</span><span style="color: #707183;">(</span><span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">msg</span>, <span style="color: #6434A3;">func</span> <span style="color: #BA36A5;">func2run</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
  <span style="color: #6434A3;">unsigned</span> <span style="color: #6434A3;">long</span> <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">start</span>, <span style="color: #BA36A5;">stop</span>;
  start = rdtsc<span style="color: #7388D6;">()</span>;
  func2run<span style="color: #7388D6;">()</span>;
  stop = rdtsc<span style="color: #7388D6;">()</span>;
  printf<span style="color: #7388D6;">(</span><span style="color: #008000;">"%s: %lld\n"</span>, msg, stop - start<span style="color: #7388D6;">)</span>;
<span style="color: #707183;">}</span>

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  init<span style="color: #7388D6;">()</span>;
  time_it<span style="color: #7388D6;">(</span><span style="color: #008000;">"in_serial()  "</span>, in_serial<span style="color: #7388D6;">)</span>;
  time_it<span style="color: #7388D6;">(</span><span style="color: #008000;">"in_parallel()"</span>, in_parallel<span style="color: #7388D6;">)</span>;
  <span style="color: #0000FF;">return</span> 0;
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
