Vorlesung/ParProg-ParalleleAlgorithmen.html
<div id="outline-container-org29d7c7a" class="outline-3">
<h3 id="org29d7c7a">using the shell</h3>
<div class="outline-text-3" id="text-org29d7c7a">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ gcc -o sseTimings sseTimings.c
bash-3.2$ ./sseTimings
<span style="color: #006699;">in_serial</span><span style="color: #707183;">()</span>  : 19905
<span style="color: #006699;">in_parallel</span><span style="color: #707183;">()</span>: 10483
bash-3.2$ ./sseTimings
<span style="color: #006699;">in_serial</span><span style="color: #707183;">()</span>  : 22260
<span style="color: #006699;">in_parallel</span><span style="color: #707183;">()</span>: 11319
bash-3.2$ ./sseTimings
<span style="color: #006699;">in_serial</span><span style="color: #707183;">()</span>  : 21785
<span style="color: #006699;">in_parallel</span><span style="color: #707183;">()</span>: 10957</pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org622f938" class="outline-2">
<h2 id="org622f938">Parallelität und Performance</h2>
<div class="outline-text-2" id="text-org622f938">
</div>
<div id="outline-container-org19b4bca" class="outline-3">
<h3 id="org19b4bca">How Can Performance Gains Through Parallelism Be Measured</h3>
<div class="outline-text-3" id="text-org19b4bca">
<p>
Parallelism and performance
</p>

<ul class="org-ul">
<li>Revised <i>sseTimings</i> program, now in 3 versions: <i>timings2048</i>,
<i>timings8192</i>, and <i>timings32768</i>:
<ul class="org-ul">
<li>Average speedup of 'serial' version from 20 test runs:<br />
'timings2048':  average speedup of 2.17    ## 2048 is vector size<br />
'timings8192':  average speedup of 1.72    ##  8192 <code>= 2048 x 4\\
       'timings32768': average speedup of 1.65    ## 32768 =</code> 8192 x 4</li>
<li>Key question: The 'in<sub>parallel</sub>()' function does only 1/4th the
arithmetic operations as the 'in<sub>serial</sub>()' function. Why is max
speedup above only slightly over 2 rather than close to (or even
at) 4?</li>
</ul></li>
</ul>
<hr />
<ul class="org-ul">
<li>How to measure performance?
<ul class="org-ul">
<li>Response time ('latency'): elapsed time
<ul class="org-ul">
<li>Program P1 takes 10 units, whereas program P2 takes 5: P1/P2 =
2, a speedup of 2</li>
</ul></li>
<li>Throughput: number of tasks completed in a fixed amount of time.
<ul class="org-ul">
<li><p>
On single-processor machine M1, with required times for processing above the arrows:
</p>
<pre class="example">
    5       3   +-----------+
T2-----&gt;T1-----&gt;| processor |  ## Two tasks completed in 8 time units on M1
                +-----------+
</pre></li>
<li><p>
On multiple-processor machine M2:
</p>
<pre class="example">
   5   +-----------+
T1-----&gt;| processor | ## T1 takes a bit longer on M2
       +-----------+
               ## Two tasks completed in 5 time units on M2, a speedup of about 1.6
   5   +-----------+
T2-----&gt;| processor | ## T2 takes the same amount of time on M1 and M2
       +-----------+
</pre></li>
</ul></li>
<li>Big picture: parallelism is a good way to boost performance
<ul class="org-ul">
<li>Parallelism tends to increase throughput, and thereby performance.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
