Vorlesung/ParProg-ParalleleAlgorithmen.html
<div id="outline-container-org667f2e0" class="outline-3">
<h3 id="org667f2e0">Amdahls Law by Example</h3>
<div class="outline-text-3" id="text-org667f2e0">
<ul class="org-ul">
<li>The law, named after its creator (a one-time IBM engineer who
founded a IBM rival company), sets a theoretical limit on the
speedup that can be achieved in a computation.
<ul class="org-ul">
<li>The law has the practical benefit of sharpening intuitions about
how speedup should be pursued.</li>
</ul></li>
<li>A sample problem for Amdahl's law: 
<ul class="org-ul">
<li>Compute the arithmetic mean of 4M floating-point values on
single-processor machine M1.  Call this problem P.</li>
<li>Compute the speedup of porting the solution to quad-processor
machine M4.
<ul class="org-ul">
<li>Assume that M1 and M4 differ only in the number of processors.</li>
</ul></li>
</ul></li>
<li>A step-by-step application of the law:
<ol class="org-ol">
<li>Compute response time for P on M1: \(RT1\)</li>
<li>Compute response time for P on M4: \(RT4\)</li>
<li>Compute the ratio: \(\frac{RT1}{RT4}\)
<ul class="org-ul">
<li>If \(\frac{RT1}{RT4} = 1\), the response times are the same: no difference between M1 and M4 performance.</li>
<li>If \(\frac{RT1}{RT4} < 1\), there's slowdown rather than speedup.</li>
<li>If \(\frac{RT1}{RT4} > 1\), there's speedup.</li>
</ul></li>
<li>Normalize \(RT1\) to 1 time unit: keeps things simple.</li>
<li>Break \(RT4\) into two parts: 
<ul class="org-ul">
<li>\(enchanced\): in this case, parallel and</li>
<li>\(unenhanced\): in this case, serial</li>
<li>The \(unenhanced\) part of \(RT4\) is the part still done in serial
mode &#x2013; no benefit of parallelism.
<ul class="org-ul">
<li>The data set needs to be partitioned, assigned to workers
(threads or processes), the results from the workers need to
be aggregated, etc.</li>
</ul></li>
<li>The \(enhanced\) part of \(RT4\) is the part that benefits from the
speedup due to parallelism.</li>
<li>\[Speedup = \frac{RT1}{RT4} = \frac{1}{unenhanced + enhanced}\]</li>
<li>The \(enhanced\) depends on two factors: what fraction of time is
sped up, and by what amount.  How much time does M4 speed in
'parallel mode' when solving P, and how much faster is M4 in
'parallel mode' than M1 in serial mode?</li>
<li>Assume M4 is four times faster than M1 when M4 is in 'parallel
mode', and that M4 is in 'parallel mode' 80% of the time when
solving P.</li>
<li>\[Speedup = \frac{RT1}{RT4} = \frac{1}{unenhanced + enhanced} = \frac{1}{0.2 + \frac{0.8}{4.0}} = 2.5\]</li>
<li>Under the given assumptions, M4 solves P 2.5 times faster than does M1.</li>
</ul></li>
</ol></li>
<li>The big picture of Amdahal's Law:
<ul class="org-ul">
<li>It's tempting to be distracted by how much faster a 'local
speedup' is: M4 is four times faster than M1 when M4 is in
'parallel mode'.</li>
<li>It's critical to focus on the fraction of time spent in enhanced
mode: M4 is in 'parallel mode' 80% of the time&#x2013;not 100% of time.</li>
</ul></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Machine</th>
<th scope="col" class="org-right">Fraction in local speedup</th>
<th scope="col" class="org-right">Local speedup</th>
<th scope="col" class="org-right">Global speedup</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M4</td>
<td class="org-right">0.8</td>
<td class="org-right">4.0</td>
<td class="org-right">2.5</td>
</tr>

<tr>
<td class="org-left">M8</td>
<td class="org-right">0.7</td>
<td class="org-right">8.0</td>
<td class="org-right">2.6</td>
</tr>

<tr>
<td class="org-left">M12</td>
<td class="org-right">0.6</td>
<td class="org-right">12.0</td>
<td class="org-right"><b>2.2</b></td>
</tr>

<tr>
<td class="org-left">M16</td>
<td class="org-right">0.5</td>
<td class="org-right">16.0</td>
<td class="org-right">1.9</td>
</tr>

<tr>
<td class="org-left">M20</td>
<td class="org-right">0.4</td>
<td class="org-right">20.0</td>
<td class="org-right">1.6</td>
</tr>

<tr>
<td class="org-left">M24</td>
<td class="org-right">0.3</td>
<td class="org-right">24.0</td>
<td class="org-right">1.4</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6616b9e" class="outline-3">
<h3 id="org6616b9e">Programming exercise for parallelism/performance</h3>
<div class="outline-text-3" id="text-org6616b9e">
<ul class="org-ul">
<li>More data gathering and reflecting on the data than coding</li>
<li>The current version calls Arrays.sort(&#x2026;) and Arrays.parallelSort(&#x2026;) on an array.
<ul class="org-ul">
<li>Array has roughly 4M array elements.</li>
<li>Speedup on the machines I tried was about 2.5 for the parallelSort.</li>
</ul></li>
<li><p>
In the interest of gathering more data, change the program so that
it tries various sizes.  For instance:
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">initialSize</span> = 1024;
  <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span> = 16; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">don't go over 20 -- overflow occurs</span>
  <span style="color: #6434A3;">int</span><span style="color: #707183;">[</span> <span style="color: #707183;">]</span> <span style="color: #BA36A5;">arraySizes</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">int</span><span style="color: #707183;">[</span>howMany<span style="color: #707183;">]</span>;
  arraySizes<span style="color: #707183;">[</span>0<span style="color: #707183;">]</span> = initialSize;
  <span style="color: #0000FF;">for</span> <span style="color: #707183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 1; i &lt; <span style="color: #6434A3;">howMany</span>; i++<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
      arraySizes<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span> = arraySizes<span style="color: #7388D6;">[</span>i - 1<span style="color: #7388D6;">]</span> * 2;
  <span style="color: #707183;">}</span></pre>
</pre>
</div>
<p>
Get the speedup for each of the sizes, and note any trends in speedup.
</p></li>
<li>Do the same for numeric types other than int, for instance, long, float, and double.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Johannes Brauer</p>
<p class="date">Created: 2017-11-09 Thu 15:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>